const meigen = {
  '1': {
    content: '苦悩を抜けて歓喜へ',
    author: 'ベートーベン'
  },
  '2': {
    content: '志を立てて以って万事の源と為す',
    author: '吉田松蔭'
  },
  '3': {
    content: '高みに向かって努力を続けることは, 決して無駄ではない',
    author: 'ニーチェ'
  },
  '4': {
    content: '普通の奴らの上を行け',
    author: 'ポール・グレアム'
  },
  '5': {
    content: '苦しいから逃げるのではない。逃げるから苦しくなるのだ。',
    author: 'ウィリアム・ジェームズ'
  },
  '6': {
    content:
      '努力よりほかにわれわれの未来をよくするものはなく、また努力よりほかにわれわれの過去を美しくするものはないのである。',
    author: '幸田露伴'
  },
  '7': {
    content:
      '努力だ。勉強だ。それが天才だ。誰よりも三倍、四倍、五倍勉強する者、それが天才だ。',
    author: '野口英世'
  },
  '8': {
    content: 'いちばんいけないのはじぶんなんかだめだと思いこむことだよ。',
    author: '野比のび太'
  },
  '9': {
    content: '小さなことを重ねることが、とんでもないところに行くただひとつの道',
    author: 'イチロー'
  },
  '10': {
    content:
      '私の人生を変えられるのは私だけ。誰も私のためにそんなことやってくれないわ。',
    author: 'キャロル・バーネット'
  },
  '11': {
    content:
      '天才とは99％の努力と1％のひらめきであるの努力と1％のひらめきである',
    author: 'トーマス・エジソン'
  },
  '12': {
    content:
      '昨日から学び、今日を懸命に生き、明日への希望を持て。大切なことは問うことをやめないことだ。',
    author: 'アインシュタイン'
  },
  '13': {
    content: '苦しむこともまた才能の一つである。',
    author: 'ドフトエフスキー'
  },
  '14': {
    content:
      '人生における大きな喜びは、「君にはできない」と世間が言うことをやってのけることである。',
    author: 'ウォルター･バジョット'
  },
  '15': {
    content: '失敗は成功の母だ',
    author: 'トーマス・エジソン'
  },
  '16': {
    content: '苦しいから逃げるのではない。逃げるから苦しくなるのだ。',
    author: 'ウィリアム･ジェームズ'
  },
  '17': {
    content:
      '平凡なことを毎日平凡な気持ちで実行することが、すなわち非凡なのである。',
    author: 'アンドレ・ジッド'
  },
  '18': {
    content:
      '努力は必ず報われる。もし報われない努力があるのならば、それはまだ努力と呼べない。',
    author: '王 貞治'
  },
  '19': {
    content: '努力を癖にしてしまえば苦労せずに成功できるだろう。',
    author: '流 音弥'
  },
  '20': {
    content: '強い者が勝つのではない。勝った者が強いのだ。',
    author: 'フランツ・ベッケンバウワー'
  },
  '21': {
    content: '努力する人は希望を語り、怠ける人は不満を語る。',
    author: '井上 靖'
  },
  '22': {
    content:
      '苦しみは人間を強くするか、それとも打ち砕くかである。その人が自分の内に持っている素質に応じてどちらかになるのである。',
    author: 'カール・ヒルティ'
  },
  '23': {
    content:
      '途中であきらめちゃいけない。途中であきらめてしまったら、得るものより失うものの方が、ずっと多くなってしまう。',
    author: 'ルイ・アームストロング'
  },
  '24': {
    content:
      '踏まれても叩かれても、努力さえしつづけていれば、必ずいつかは実を結ぶ。',
    author: '升田幸三'
  },
  '25': {
    content:
      '石の上にも三年という。しかし、三年を一年で習得する努力を怠ってはならない。',
    author: '松下幸之助'
  },
  '26': {
    content: '進まざる者は必ず退き、退かざる者は必ず進む。',
    author: '福沢諭吉'
  },
  '27': {
    content:
      'つらい道を避けないこと。自分の目指す場所にたどりつくためには進まなければ。',
    author: 'キャサリン・アン・ポータ'
  },
  '28': {
    content:
      '目標を達成するには、全力で取り組む以外に方法はない。そこに近道はない。',
    author: 'マイケル・ジョーダン'
  },
  '29': {
    content: 'もうこれで満足だという時は、すなわち衰える時である',
    author: '渋沢栄一'
  },
  '30': {
    content:
      '人間を賢くし人間を偉大にするものは、過去の経験ではなく、未来に対する期待である。なぜならば、期待をもつ人間は、何歳になっても勉強するからである。',
    author: 'バーナード・ショー'
  },
  '31': {
    content:
      '自分自身を最大限に利用しなさい。あなたにとって、あるのはそれだけなのですから。',
    author: 'エマーソン'
  },
  '32': {
    content:
      '人間は、目標を追い求める動物である。目標へ到達しようと努力することによってのみ、人生が意味あるものとなる。',
    author: 'アリストテレス'
  },
  '33': {
    content:
      '努力が効果をあらわすまでには時間がかかる。多くの人はそれまでに飽き、迷い、挫折する。',
    author: 'ヘンリー・フォード'
  },
  '34': {
    content: '自分に打ち勝つことが、最も偉大な勝利である.',
    author: 'プラトン'
  },
  '35': {
    content:
      '重荷があるからこそ、人は努力するのである。重荷があるからこそ、大地にしっかりと足をつけて歩いていける。',
    author: '野村克也'
  },
  '36': {
    content:
      '人間にとって最高の幸福は、一年の終わりにおける自己を、その一年の始めにおける遥かに良くなったと感ずることである。',
    author: 'トルストイ'
  },
  '37': {
    content:
      '生きている間は、なにごとも延期するな。なんじの実行また実行であれ。',
    author: 'ゲーテ'
  },
  '38': {
    content: '目的を忘れることは、愚かな人間にもっともありがちなことだ。',
    author: 'ニーチェ'
  },
  '39': {
    content: 'とじこめられている火が、いちばん強く燃えるものだ。',
    author: 'シェイクスピア'
  },
  '40': {
    content: '満足は努力の中にあって、結果にあるものではない。',
    author: 'ガンジー'
  },
  '41': {
    content:
      '普通の努力では、チャンスをチャンスと見極められない。熱心の上に熱心であることが見極める眼を開く。',
    author: '松下幸之助'
  },
  '42': {
    content: '豊かさと平和は、臆病者をつくる。苦難こそ強さの母だ',
    author: 'シェイクスピア'
  },
  '43': {
    content: '逆境の中で咲く花は、どの花よりも貴重で美しい。',
    author: 'ウォルト・ディズニー'
  },
  '44': {
    content:
      '喜びとは、勝利それ自体にではなく、途中の戦い、努力、苦闘の中にある。',
    author: 'ガンジー'
  },
  '45': {
    content:
      '昔を振り返るのはここでやめにしよう。大切なのは明日何が起きるかだ。',
    author: 'スティーブ・ジョブス'
  },
  '46': {
    content:
      '万策尽きたと思うな。自ら断崖絶壁の淵にたて。その時はじめて新たなる風は必ず吹く。',
    author: '松下幸之助'
  },
  '47': {
    content: '人を信じよ、しかし、その百倍も自らを信じよ。',
    author: '手塚治虫'
  },
  '48': {
    content: '優れた人間は、どんなに不幸で苦しい境遇でも、黙って耐え忍ぶ',
    author: 'ベートーベン'
  },
  '49': {
    content:
      '人間の価値は、絶望的な敗北に直面して、いかにふるまうかにかかっている。',
    author: 'ヘミングウェイ'
  },
  '50': {
    content:
      '私は決して障害に屈しはしない。いかなる障害も、私の中に強い決意を生み出すまでだ',
    author: 'レオナルド・ダ・ヴィンチ'
  }
};

const objectToMap = (object: any) => new Map(Object.entries(object));

const jsonMap = objectToMap(meigen);

export const getRandomMeigen = () => {
  const randnum = Math.floor(Math.random() * 50) + 1;
  return jsonMap.get(randnum.toString());
};
